<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Faq;

class FaqSeeder extends Seeder
{
    public function run()
    {
        Faq::insert([
            ['question' => 'Q､TaxBar®のVIPプランの特典を教えてください｡', 'answer' => 'A､通常のサービスに加えて動画配信が制限なしで配信することができます｡'],
            ['question' => 'Q､度々TaxBar®に通報しているが､値引き交渉が多く困っている｡', 'answer' => 'A､ユーザー登録を抹消することを検討いたします｡再度お問い合わせより通報ください｡'],
            ['question' => 'Q､TaxBar®のWEB支店をだすことはできますか？', 'answer' => 'A､ご相談に応じていますのでお問い合わせください｡'],
            ['question' => 'Q､axBar®には税理士でないとBARを開店することはできませんか？', 'answer' => 'A､いいえ｡税理士登録をしていない公認会計士やその他ファイナンシャルプランナーや中小企業診断士の方も有料登録が可能です｡ただし､税理士でない場合は税務に関する相談などを行うことはできません｡税務以外のカテゴリでご参加ください｡'],
            ['question' => 'Q､ファイナンシャルプランナーとして参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､税理士事務所が､税理士でない従業員を参加させることは可能ですか？', 'answer' => 'A､可能です｡ただし､税理士の指揮命令によって雇用されている者であれば参加可能です｡業務委託先や外注者､記帳代行会社などを参加させることは控えてください｡また､雇用されている者が参加される場合は､どこの税理士事務所の従業員なのかをユーザーに開示する義務を負ってください｡'],
            ['question' => 'Q､経営者の伴奏をしている者ですが参加することはできますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､税金以外の相談もしても構いませんか？', 'answer' => 'A､可能です｡TaxBar所属の税理士であれば､弁護士や司法書士､社会保険労務士などの専門家を紹介できることが多いのでお願いしてみましょう｡'],
            ['question' => 'Q､父親が亡くなり相続が発生しました｡なにをしてよいかわかりません｡', 'answer' => 'A､相続関連のTaxBarでご相談下さい｡相続税のことのみならず必要な手続きを税理士が教えてくれる可能性が高いです｡'],
            ['question' => 'Q､遺留分で揉めています｡これはTaxBarで相談可能でしょうか？', 'answer' => 'A､紛争性を有する事件は民事のため税理士は介入することはできません｡しかし､相続Bar関連にて相談すれば税理士から弁護士の紹介を受けれる可能性が高いです｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],
            ['question' => 'Q､補助金専門とした内容で参加できますか？', 'answer' => 'A､可能です｡ただし税務に関するイベントこれに準ずることは行ってはいけません｡'],

        ]);
    }
}
